{
  "_meta": {
    "sources": [
      {
        "json": "EHB",
        "abbreviation": "EHB",
        "full": "Elinari Homebrew",
        "authors": [
          "Tegan \"Elinari\" Harris"
        ],
        "url": "",
        "version": "1.0",
        "targetSchema": "1.0.0"
      }
    ]
  },
  "itemProperty": [
    
  ],
  "item": [
    {
      "name": "Va'ardalia's Legacy",
      "type": "M",
      "weaponCategory": "Martial",
      "baseItem": "longsword|phb",
      "weight": "3",
      "dmg1": "{@dice 1d8}",
      "dmg2": "{@dice 1d10}",
      "dmgType": "S",
      "property": [
        "V"
      ],
      "rarity": "Artifact",
      "source": "EHB",
      "reqAttune": true,
      "entries": [
        "This sword, originally owned by Aribeth (Va'ardalia) de Tylmarande, has known both justice and corruption. Returned to the Tylmarande family after Aribeth's death, it serves as a reminder of Aribeth's fall to darkness and the shame she brought to her family name. While retaining the visual appearance of nothing more than a well-crafted longsword, there are deeper layers of history and power to the weapon.",
        {
          "name": "Legacy",
          "type": "entries",
          "entries": [
            "This weapon can only be attuned to by someone of the Tylmarande bloodline. Any attempt made by someone outside of the bloodline results in swift and painful incapacitation at best, instant death at worst.",
			      "Due to its high level of craftsmanship, the weapon grants a +1 bonus to attack and damage rolls."
			    ]
		    },
		    {
          "name": "Vengeance",
          "type": "entries",
          "entries": [
            "When you use this weapon to attack a target that has caused damage to you in this combat encounter, your bonus to attack and damage rolls against that target increases to +3."
          ]
        },
		    {
          "name": "Dark Motive",
          "type": "entries",
          "entries": [
            "There is no avoiding the dark past of a blade wielded in anger- though how this may manifest is as yet undiscovered. (TT)"
          ]
        },
		    {
          "name": "Descent",
          "type": "entries",
          "entries": [
            "As they fall, so may they yet rise again. If the bearer is attuned to both Va'ardalia's Legacy and its counterpart, you gain the ability to regenerate hit points equal to your level whenever you successfully deal damage to a living creature."
          ]
        }
	    ]
    },
    {
      "name": "Tolivast's Trickery",
      "rarity": "Artifact",
      "source": "EHB",
      "reqAttune": true,
      "entries": [
        "Known to most as 'the False Crown of Neverwinter', this formerly cursed artifact was used by Seldra Tylmarande in her attempt to claim the throne of Neverwinter. This version of the crown was believed to have been destroyed. Three of its four false sapphires bear cracks - the fourth remains flawless.",
        {
          "name": "Legacy",
          "type": "entries",
          "entries":[
            "This item can only be attuned to by someone of the Tylmarande bloodline. Any attempt made by someone outside of the bloodline results in instant death to fire and ice."
          ]
        },
        {
          "name": "Former Madness",
          "type": "entries",
          "entries":[
            "The first time the bearer of this item is attuned to it and enters within 60 feet of Va'ardalia's Legacy, roll a d20. On a score or 12 or lower, they begin to succumb to the remnants of Tolivast's spell. If the die roll was an even number, they begin to experience mild hallucinations. If the die roll was an odd number, they become incapable of speech for one minute. On a roll of 1, they become frightened of the nearest person to them- this lasts until they are no longer in contact with the crown, or until they move beyond 60 feet of Va'ardalia's Legacy."
          ]
        }
      ]
    },
    {
      "name": "Aribeth's Atonement",
      "type": "RG",
      "weight": "1",
      "rarity": "Artifact",
      "source": "EHB",
      "reqAttune": true,
      "entries":[
        "Once a simple ring worn by Aribeth de Tylmarande, this silver band has been transfigured to roughly resemble the Crown of Neverwinter. Each of the four main sapphire chips pulses with arcane power.",
        {
          "name": "Legacy",
          "type": "entries",
          "entries": [
            "This item can only be attuned to by someone of the Tylmarande bloodline. Any attempt made by someone outside of the bloodline results in paralysis that lasts for a full day after the ring has been removed."
          ]
        },
        {
          "name": "Family Honor",
          "type": "entries",
          "entries": [
            "The first time the bearer of this item is attuned to it and enters within 120 feet of Va'ardalia's Legacy, roll a d20. On a score of 10 or higher, they can pinpoint the location of Va'ardalia's Legacy to within a 10 foot radius. On a score of less than 10, they begin to hear phantom whispers of prayer to Tyr."
          ]
        },
        {
          "name": "Sapphire: North/Front",
          "type": "entries",
          "entries": [
            "Activating this stone immediately projects a relevant memory into the user's mind. The memory may play out in a number of ways, and over an unpredictable time period.",
            "The user experiences this memory in the first person, as if they were the original creator. They retain some level of abstract awareness, but cannot influence what happens."
          ]
        },
        {
          "name": "Sapphire: South/Back",
          "type": "entries",
          "entries": [
            "When activated, the area immediately around the user is plunged into darkness. Even darkvision cannot see through it, and it spreads slowly outwards at a rate of 5 feet every 6 seconds, to a maximum radius of 60 feet from the user.",
            "The user and anyone else in the area hears whispers from unseen voices. Anyone inside the sphere of darkness who is blood-related to the user must make a DC12 Wisdom saving throw; on a fail, they take 2d8 psychic damage. Other party members must make a DC10 Wisdom saving throw, taking 1d8 psychic damage on a fail."
          ]
        },
        {
          "name": "Sapphire: East/Right",
          "type": "entries",
          "entries": [
            "On activating the stone, the user disappears from sight. They are invisible from all types of sight, cannot be detected by divination magic. The effect lasts for as long as the user keeps physical contact with Aribeth's Atonement.",
            "The user can still see and hear the world around them, though it is muted and muffled, as if being seen through a heavy gauze curtain. If they interact with an object or creature, the effect is not extended to it."
          ]
        },
        {
          "name": "Sapphire: West/Left",
          "type": "entries",
          "entries": [
            "The user must make a DC12 Intelligence saving throw on activating this stone; on a failure, they take 2d8 psychic damage and the spell ends. On a success, they are able to make contact with the spirit of either Aribeth or Seldra.",
            "The user may ask the spirit up to 5 questions that can be answered with a single word ('yes', 'no', 'uncertain', 'danger', etc.) or a short phrase of up to 5 words. The spirit has no visible presence, and cannot be interacted with by anyone except the user."
          ]
        },
        {
          "name": "Arise",
          "type": "entries",
          "entries":[
            "If the bearer is attuned to both Aribeth's Atonement and Va'ardalia's Legacy, they gain resistance to spells of all types."
          ]
        }
      ]
    },
    {
      "name": "Waterdhavian Winter Gloves",
      "weight": "1",
      "rarity": "none",
      "source": "EHB",
      "entries":[
        "A pair of delicate yet well-made gloves. Worn by Waterdhavian locals in the colder months, this pair is sized for an older child or petite woman, and is surprisingly resistant to cold and damp.",
        {
          "name": "Clever Craftwork",
          "type": "entries",
          "entries": [
            "While keeping your hands surprisingly warm, anyone holding snow or ice in their hands while wearing these gloves might notice that it melts a lot slower than it should - making for better snowballs! You gain +1 to any ranged snowball attack made while wearing these gloves - but only if outdoors."
          ]
        }
      ]
    },
    {
      "name": "Toy Slingshot",
      "type": "R",
			"weapon": true,
			"weaponCategory": "Simple",
			"rarity": "None",
			"value": "1 sp",
			"dmg1": "{@dice 1d2}",
			"dmgType": "B",
			"property": [
				"A"
			],
			"range": "30/120",
      "source": "EHB",
      "entries":[
        "A sturdy slingshot of treated wood, rubber-like strips and a dark leather pocket.",
        {
          "name": "Mischief Managed",
          "type": "entries",
          "entries": [
            "This was gifted to Aricia by Mikael after watching her throw Goodberries at Gailardia. Now she can 'throw' them even further..."
          ]
        }
      ]
    },
    {
      "name": "Dual-Bladed Glaive",
      "type": "M",
      "weaponCategory": "Martial",
      "baseItem": "glaive|phb",
      "weight": "8",
      "dmg1": "{@dice 1d8}",
      "dmgType": "S",
      "property": [
        "2H"
      ],
      "rarity": "Uncommon",
      "source": "EHB",
      "reqAttune": true,
      "entries": [
        "A less common style of glaive, this weapon has a blade on each of its ends. Wielders have specialised beyond normal two-weapon fighting training to be able to deal more damage in a single flowing move than most other polearm weapons.",
		    {
          "name": "Reach",
          "type": "entries",
          "entries": [
            "This weapon adds 5 feet to your reach when you attack with it. This property also determines your reach for opportunity attacks with a reach weapon."
          ]
        },
		    {
          "name": "Heavy",
          "type": "entries",
          "entries": [
            "Small creatures have disadvantage on attack rolls with heavy weapons. A heavy weapon's size and bulk make it too large for a Small creature to use effectively."
          ]
        }
	    ]
    },
    {
			"name": "Paper Hummingbird",
			"wondrous": true,
			"rarity": "Rare",
			"source": "EHB",
			"entries": [
				"After you write a message of fifteen words or fewer on this magic sheet of parchment and speak a creature's name, the parchment magically folds into a Tiny paper hummingbird and flies to the recipient whose name you uttered. The recipient must be on the same plane of existence as you, otherwise the bird turns into ash as it takes flight.",
				"The hummingbird is an object that has 1 hit point, an Armor Class of 15, a flying speed of 100 feet, a Dexterity of 18 (+4), and a score of 1 (−5) in all other abilities, and it is immune to poison and psychic damage.",
				"It travels to within 5 feet of its intended recipient by the most direct route, whereupon it turns into a nonmagical and inanimate sheet of parchment that can be unfolded only by the intended recipient. If the bird's hit points or speed is reduced to 0 or if it is otherwise immobilized, it turns into ash.",
				"Paper Hummingbirds are crafted as needed, as the spells imbued in the parchment are more delicate and difficult."
			]
    },
    {
			"name": "Paper Raven",
			"wondrous": true,
			"rarity": "Rare",
			"source": "EHB",
			"entries": [
				"After you write a message of fifty words or fewer on this magic sheet of parchment and speak a creature's name, the parchment magically folds into a paper raven and flies to the recipient whose name you uttered. The recipient must be on the same plane of existence as you, otherwise the bird turns into ash as it takes flight.",
				"The raven is an object that has 3 hit points, an Armor Class of 13, a flying speed of 60 feet, a Dexterity of 14 (+2), and a score of 1 (−5) in all other abilities, and it is immune to poison and psychic damage.",
        "It travels to within 5 feet of its intended recipient by the most direct route, whereupon it turns back into a sheet of parchment that can be unfolded only by the intended recipient. If the bird's hit points or speed is reduced to 0 or if it is otherwise immobilized, it turns into ash.",
        "If the recipient has a response to the message, the parchment allows it to write a second message of fifty words or fewer. Once the word limit is reached or when the recipient declares it 'done', the parchment refolds into the raven and returns to the original sender.",
				"Paper Ravens are crafted as needed, due to the resource cost."
			]
    },
    {
			"name": "Paper Butterfly: Pieridae (Small)",
			"wondrous": true,
			"rarity": "Rare",
			"source": "EHB",
			"entries": [
				"After you write a message of fifteen words or fewer on this magic sheet of parchment and speak a creature's name, the parchment magically folds into a Tiny paper butterfly and flies to the recipient whose name you uttered. The recipient must be on the same plane of existence as you, otherwise the butterfly turns into ash as it takes flight.",
				"The butterfly is an object that has 1 hit point, an Armor Class of 10, a flying speed of 60 feet, a Dexterity of 12 (+1), and a score of 1 (−5) in all other abilities.",
				"It travels to within 5 feet of its intended recipient by the most direct route, whereupon it turns into a nonmagical and inanimate sheet of parchment that can be unfolded only by the intended recipient. If the butterfly's hit points or speed is reduced to 0 or if it is otherwise immobilized, it turns into ash.",
				"A butterfly that does not find its intended recipient within 12 hours loses integrity and turns to ash."
			]
    },
    {
			"name": "Paper Butterfly: Riodinidae (Medium)",
			"wondrous": true,
			"rarity": "Rare",
			"source": "EHB",
			"entries": [
				"After you write a message of thirty words or fewer on this magic sheet of parchment and speak a creature's name, the parchment magically folds into a Tiny paper butterfly and flies to the recipient whose name you uttered. The recipient must be on the same plane of existence as you, otherwise the butterfly turns into ash as it takes flight.",
				"The butterfly is an object that has 1 hit point, an Armor Class of 11, a flying speed of 45 feet, a Dexterity of 12 (+1), and a score of 1 (−5) in all other abilities.",
				"It travels to within 5 feet of its intended recipient by the most direct route, whereupon it turns into a nonmagical and inanimate sheet of parchment that can be unfolded only by the intended recipient. If the butterfly's hit points or speed is reduced to 0 or if it is otherwise immobilized, it turns into ash.",
				"A butterfly that does not find its intended recipient within 18 hours loses integrity and turns to ash."
			]
    },
    {
			"name": "Paper Butterfly: Papilionidae (Large)",
			"wondrous": true,
			"rarity": "Rare",
			"source": "EHB",
			"entries": [
				"After you write a message of fifty words or fewer on this magic sheet of parchment and speak a creature's name, the parchment magically folds into a Tiny paper butterfly and flies to the recipient whose name you uttered. The recipient must be on the same plane of existence as you, otherwise the butterfly turns into ash as it takes flight.",
				"The butterfly is an object that has 1 hit point, an Armor Class of 12, a flying speed of 30 feet, a Dexterity of 12 (+1), and a score of 1 (−5) in all other abilities.",
				"It travels to within 5 feet of its intended recipient by the most direct route, whereupon it turns into a nonmagical and inanimate sheet of parchment that can be unfolded only by the intended recipient. If the butterfly's hit points or speed is reduced to 0 or if it is otherwise immobilized, it turns into ash.",
				"A butterfly that does not find its intended recipient within 24 hours loses integrity and turns to ash."
			]
		}
  ]
}
       