{
  "_meta": {
    "sources": [
      {
        "json": "BCC",
        "abbreviation": "BCC",
        "full": "badgr's Custom Compendium - Items",
        "authors": [
          "Dale \"badgr_\" Emasiri"
        ],
        "url": "",
        "version": "1.0",
        "targetSchema": "1.0.0"
      }
    ]
  },
  "itemProperty": [
    
  ],
  "item": [
    {
      "name": "Fate's Circlet",
      "wondrous": true,
      "tier": "Major",
      "rarity": "Uncommon",
      "source": "BCC",
      "reqAttune": true,
      "entries": [
        "While wearing this circlet, you look human. No horns or tail, less red in your skin colour, and your eyes are hazel. The spell ends if the circlet is removed."
      ]
    },
    {
      "name": "Virtuous Silken Wraps",
      "wondrous": true,
      "tier": "Major",
      "rarity": "Rare",
      "source": "BCC",
      "reqAttune": true,
      "entries": [
        "When worn by a creature who has control over their body's energy - known as Ki - the wraps amplify the virtue of patience within the wielder, bringing upon them a sense of calm.",
        "A Monk wearing these wraps may use Patient Defence as a bonus action without expending a Ki point."
      ]
    },
    {
      "name": "Invicta",
      "type": "R",
      "tier": "Major",
      "weapon": true,
      "weaponCategory": "Martial",
      "rarity": "Uncommon",
      "weight": "3",
      "dmg1": "{@dice 1d10 + 1}",
      "genericBonus": "+1",
      "dmgType": "P",
      "entries": [
        "You have a +1 bonus to attack and damage rolls made with this weapon."
      ],
      "property": [
        "AF",
        "RLD"
      ],
      "range": "80/240",
      "reload": "3",
      "source": "BCC"
    },
    {
      "name": "Mace of Qotal",
      "type": "M",
      "weaponCategory": "Simple",
      "baseItem": "mace|phb",
      "genericBonus": "+1",
      "weight": "4",
      "dmg1": "{@dice 1d6}",
      "dmgType": "B",
      "rarity": "Rare",
      "source": "BCC",
      "reqAttune": true,
      "entries": [
        "When you hit a fiend or an undead with this magic weapon, that creature takes an extra {@dice 2d6} radiant damage. If the target has 25 hit points or fewer after taking this damage, it must succeed a DC 15 Wisdom saving throw or be destroyed. On a successful save, the creature becomes {@condition frightened} of you until the end of your next turn.",
        "While you hold this weapon, it sheds a bright light in a 20-foot radius and dim light for an additional 20 feet."
      ]
    },
    {
      "name": "Ary'Faern'Kerym, the Artblade",
      "type": "M",
      "weaponCategory": "Martial",
      "baseItem": "longsword|phb",
      "weight": "3",
      "dmg1": "{@dice 1d8}",
      "dmg2": "{@dice 1d10}",
      "dmgType": "S",
      "property": [
        "V"
      ],
      "rarity": "Legendary",
      "source": "BCC",
      "reqAttune": "by an Elf or Half-Elf of Neutral Good Alignment",
      "sentience": true,
      "entries": [
        "This weapon requires an attunement ritual that consumes 200 gold pieces worth of materials, and takes 8 hours. The blade has restrictions placed upon its wielder.",
        "You know its name. It is Ary'Faern'Kerym, the Artblade. It is an ancient blade crafted by the Sel'ryr, the first elven civilization of the world before the fall of the first age of civilization. It is a sword lost in mystery and legend, but here it sits before you as if a god among all of the weapons of the world.",
        "The Artblade serves only one master at a atime. The attunement process has specific restrictions and may only be wielded by one of elven lineage, of Neutral Good alignment, and one of virtue.",
        "Ary'Faern'Kerym won't serve anyone that it believes to be craven, erratic, corrupt, or at odds with preserving and protecting elvenkind. If the blade rejects you, you make ability checks, attack rolls, and saving throws at disadvantage for 24 hours. If the blade accepts you, you become attuned to it and a new rune appears on the blade. You remain attuned to it until you die or the weapon is destroyed.",
        {
          "type": "table",
          "caption": "Ary'Faern'Kerym Runes",
          "colStyles": [
            "col-1 text-align-center",
            "col-11"
          ],
          "rows": [
            ["1", "Feryn: +1 bonus to damage and attack rolls"],
            ["2", "Drisbynn: +2 initiative"],
            ["3", "Velazane: +2 bonus to damage and attack rolls"],
            ["4", "Caigwyn: gains the defender weapon properties"],
            ["5", "Dorren: functions as a ring of spell storing"],
            ["6", "Taanyth: becomes a vorpal sword"]
          ]
        },
        {
          "name": "Sentience",
          "type": "entries",
          "entries": [
            "Ary'Faern'Kerym is a sentient, Neutral Good weapon with an Intelligence of 12, a Wisdom of 10, and a Charisma of 12. It has hearing and darkvision out to a range of 120 feet.",
            "The weapon communicates by transmitting emotions, sending a tingling sensation through the wielder's hand when it wants to communicate something it has sensed. It can communicate more explicitly, through visions or dreams, when the wielder is either in a trance or asleep."
          ]
        },
        {
          "name": "Personality",
          "type": "entries",
          "entries": [
            "Every moonblade seeks the advancement of elvenkind and elven ideals. Courage, loyalty, beauty, music, and life are all part of this purpose.",
            "Once it has bonded to an owner who shares its ideals, its loyalty is absolute.",
            "If Ary'Faern'Kerym has a flaw, it is overconfidence. Once it has decided on an owner, it believes that only that person should wield it, even if the owner falls short of elven ideals."
          ]
        }
      ]
    },
    {
      "name": "Sepa Caex",
      "type": "M",
      "weaponCategory": "Martial",
      "baseItem": "longsword|phb",
      "weight": "3",
      "dmg1": "{@dice 1d8}",
      "dmg2": "{@dice 1d10}",
      "dmgType": "S",
      "property": [
        "V"
      ],
      "rarity": "Legendary",
      "source": "BCC",
      "reqAttune": true,
      "entries": [
        "This weapon, forged from the amalgamation of Torinn Balasar's soul and the Azure Stone - something that was until recently a lost artifact of great and unknown power. Little was known about the Azure stone and now without the stone to study further much of the information will now be lost to the world besides the sword itself.",
        {
          "name": "States",
          "type": "entries",
          "entries": [
            "This legendary weapon is considered an incredibly powerful artifact with its own will.",
            "Sepa Caex, colloquially translated from Draconic to meaning Soul Blade, is the result of Torinn Balasar's merger with the Azure Stone - an artifact of unkown origin and power. Now the sword bears his soul and can only be awakened by a single user: Raianne Balasar.",
            "When attuned to anyone else other than Raianne, this weapon will remain in its dormant state until attuned by Raianne again.",
            {
              "name": "Dormant",
              "type": "entries",
              "entries": [
                "You have a +1 bonus to attack and damage rolls with this magic weapon."
              ]
            },
            {
              "name": "Risen",
              "type": "entries",
              "entries": [
                "The bonus to attack and damage rolls increase to a +2.",
                "Additionally, targets that are damaged by this weapon take an additional 1d6 points of ice damage. On a critical hit, this damage becomes 2d6 (or 1d6 * 2, depending on your GM's critical hit houserules) like any other critical hit damage dice."
              ]
            },
            {
              "name": "Awakened",
              "type": "entries",
              "entries": [
                "The bonus to attack and damage rolls increase to a +3.",
                "When you hit a target affected by Hexblade's Curse with this weapon, you can teleport instantly and make an attack against an additional creature within 15ft of the first. You gain the following benefits:",
                {
                  "type": "entries",
                  "entries": [
                    "",
                    "• You gain bonus to damage rolls against the target. The bonus equals your proficiency bonus.",
                    "• Any attack roll you make against the target is a critical hit on a roll of 19 or 20 on the d20.",
                    "• If the first target dies while affected by Hexblade's Curse and the second attack successfully hits a new target, Hexblade's Curse transfers to the new target. If the original target survives, Hexblade's Curse continues to affect them and not the new target.",
                    "• A critical hit grants an additional, free teleport attack."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
